<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
        <key>Description</key>
        <string>Downloads FreeMind and imports into Munki.</string>
        <key>Input</key>
        <dict>
                <key>IDENTIFIER</key>
                <string>com.github.uib.autopkg-recipes.munki.FreeMind</string>
                <key>MUNKI_REPO_SUBDIR</key>
                <string>apps/freemind</string>
                <key>NAME</key>
                <string>FreeMind</string>
                <key>SOURCEFORGE_FILE_PATTERN</key>
                <string>FreeMind_[0-9\.]*\.dmg</string>
                <key>SOURCEFORGE_PROJECT_ID</key>
                <string>7118</string>
                <key>pkginfo</key>
                <dict>
                        <key>catalogs</key>
                        <array>
                                <string>testing</string>
                        </array>
                        <key>description</key>
                        <string>A mind mapper, and at the same time an easy-to-operate hierarchical editor with strong emphasis on folding.</string>
                        <key>name</key>
                        <string>%NAME%</string>
                        <key>unattended_install</key>
                        <true/>
                </dict>
        </dict>
        <key>Process</key>
        <array>
                <dict>
                        <key>Processor</key>
                        <string>SourceForgeURLProvider</string>
                </dict>
                <dict>
                        <key>Processor</key>
                        <string>URLDownloader</string>
                        <key>Arguments</key>
                        <dict>
                                <key>filename</key>
                                <string>%NAME%.dmg</string>
                        </dict>
                </dict>
                <dict>
                        <key>Processor</key>
                        <string>EndOfCheckPhase</string>
                </dict>
                <dict>
                        <key>Arguments</key>
                        <dict>
                                <key>pkg_path</key>
                                <string>%pathname%</string>
                                <key>repo_subdirectory</key>
                                <string>%MUNKI_REPO_SUBDIR%</string>
                        </dict>
                        <key>Processor</key>
                        <string>MunkiImporter</string>
                </dict>
        </array>
</dict>
</plist>