<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Vagrant and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.uib.autopkg-recipes.munki.Vagrant</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/vagrant</string>
        <key>NAME</key>
        <string>Vagrant</string>
    	<key>pkginfo</key>
    	<dict>
    		<key>catalogs</key>
    		<array>
    			<string>testing</string>
    		</array>
            <key>category</key>
            <string>Developer Tools</string>
            <key>developer</key>
            <string>HashiCorp</string>
            <key>display_name</key>
            <string>Vagrant</string>
    		<key>description</key>
    		<string>Vagrant is a tool for building complete development environments. With an easy-to-use workflow and focus on automation, Vagrant lowers development environment setup time, increases development/production parity, and makes the "works on my machine" excuse a relic of the past.</string>
    		<key>name</key>
    		<string>%NAME%</string>
    		<key>unattended_install</key>
    		<true/>
    	</dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.uib.autopkg-recipes.download.Vagrant</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>