<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the latest version of Radiant Player for Google Play Music and imports it into Munki.</string>
    <key>Identifier</key>
    <string>com.github.uib.autopkg-recipes.munki.RadiantPlayer</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/googlemusic</string>
        <key>NAME</key>
        <string>Radiant Player for Google Play Music</string>
    	<key>pkginfo</key>
    	<dict>
    		<key>catalogs</key>
    		<array>
    			<string>testing</string>
    		</array>
            <key>display_name</key>
            <string>Radiant Player for Google Play Music</string>
    		<key>description</key>
    		<string>Turn Google Music into a separate, beautiful application that integrates with your Mac.</string>
    		<key>name</key>
    		<string>Radiant Player for Google Play Music</string>
    		<key>unattended_install</key>
    		<true/>
    	</dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.uib.autopkg-recipes.download.RadiantPlayer</string>
    <key>Process</key>
    <array>
  	<dict>
     	    <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>DmgCreator</string>
            <key>Arguments</key>
            <dict>
                <key>dmg_root</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%</string>
                <key>dmg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%dmg_path%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>