<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Stat/transfer and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.uib.autopkg-recipes.munki.StatTransfer</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>StatTransfer</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/stattransfer</string>
		<key>DOWNLOAD_URL</key>
        <string>http://www.stattransfer.com/downloads/stdemo.dmg</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Productivity</string>
            <key>developer</key>
            <string>Circle Systems</string>
            <key>description</key>
            <string>Stat/Transfer has provided fast, reliable, and convenient data transfer between popular software packages for thousands of users, worldwide. A licencecode is needed to use this program.</string>
            <key>display_name</key>
            <string>Stat/Transfer</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
		<dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>