<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest TIDAL and imports it into munki</string>
    <key>Identifier</key>
    <string>com.github.uib.autopkg-recipes.munki.TÃDAL</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>TIDAL</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/tidal</string>
        <key>SPARKLE_FEED_URL</key>
        <string>http://download.tidal.com/desktop/appcast.xml</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Music</string>
            <key>developer</key>
            <string>TIDAL</string>
            <key>description</key>
            <string>TIDAL offers high-fidelity CD sound quality, high quality video, expertly curated content and editorial, and unique artists experiences.</string>
            <key>display_name</key>
            <string>TIDAL</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%SPARKLE_FEED_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
