<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest WiMP and imports it into munki</string>
    <key>Identifier</key>
    <string>com.github.uib.autopkg-recipes.munki.WiMP</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>WiMP</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/bettertouchtool</string>
        <key>SPARKLE_FEED_URL</key>
        <string>http://client.wimpmusic.com/wimpsetup/desktop/update/wimp.update.osx.NO.xml</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>WiMP er en musikktjeneste som inspirerer deg til å finne ny musikk og gamle favoritter. Med lokale redaksjoner i hvert land gir WiMP deg daglige tips, anbefalinger og spillelister for enhver anledning.</string>
            <key>display_name</key>
            <string>WiMP</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>SparkleUpdateInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>appcast_url</key>
                <string>%SPARKLE_FEED_URL%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>