<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
        <key>Description</key>
        <string>Downloads the current release version of Inkscape and imports into Munki.</string>
        <key>Identifier</key>
        <string>com.github.uib.autopkg-recipes.munki.Inkscape</string>
        <key>Input</key>
        <dict>
                <key>NAME</key>
                <string>Inkscape</string>
                <key>MUNKI_REPO_SUBDIR</key>
                <string>apps/inkscape</string>
                <key>pkginfo</key>
                <dict>
                        <key>catalogs</key>
                        <array>
                                <string>testing</string>
                        </array>
                        <key>description</key>
                        <string>Vector imageing</string>
                        <key>display_name</key>
                        <string>Inkscape</string>
                        <key>name</key>
                        <string>%NAME%</string>
                        <key>unattended_install</key>
                        <true/>
                </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.9</string>

    <key>Process</key>
     <array>
        <dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
                <key>Arguments</key>
                <dict>
                    <key>url</key>
                    <string>http://inkscape.org/en/download/</string>
                    <key>re_pattern</key>
                <string>(http://.*/Inkscape-[0-9\.].dmg)</string>
                <key>result_output_var_name</key>
                <string>url</string>
                </dict>
            </dict>
                <dict>
                        <key>Processor</key>
                        <string>URLDownloader</string>
                        <key>Arguments</key>
                        <dict>
                                <key>filename</key>
                                <string>%NAME%.dmg</string>
                        </dict>
                </dict>
                <dict>
                        <key>Processor</key>
                        <string>EndOfCheckPhase</string>
                </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
