<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release of Lacie Intego backup software.</string>
    <key>Identifier</key>
    <string>com.github.uib.autopkg-recipes.munki.Intego</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>intego</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/lacie</string>
		<key>DOWNLOAD_URL</key>
        <string>http://www.integodownload.com/mac/X/LaCie/IntegoBackupAssistant.dmg</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Intego Backup Assistant offers an ideal solution for the home user who is looking for a simple, user-friendly way to back up personal data to a safe location and be able to retrieve it easily.</string>
            <key>display_name</key>
            <string>Intego Backup Assistant</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
     <array>
     	        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%DOWNLOAD_URL%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>installs</key>
                    <array>
                        <dict>
                            <key>CFBundleIdentifier</key>
                            <string>com.intego.BackupAssistant</string>
                            <key>CFBundleName</key>
                            <string>Intego Backup Assistant</string>
                            <key>path</key>
                            <string>/Applications/Intego Backup Assistant.app</string>
                            <key>type</key>
                            <string>file</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>