<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads Intego Backup Assistant and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.uib.autopkg-recipes.munki.Intego</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Intego</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/lacie</string>
        <key>MAKEPKGINFO_PKGNAME</key>
        <string>Double Click to Install.app/Contents/Resources/Intego Backup Assistant.pkg</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Intego Backup Assistant offers an ideal solution for the home user who is looking for a simple, user-friendly way to back up personal data to a safe location and be able to retrieve it easily.</string>
            <key>display_name</key>
            <string>Intego Backup Assistant</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true/>
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>ParentRecipe</key>
    <string>com.github.uib.autopkg-recipes.download.Intego</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>munkiimport_pkgname</key>
                <string>%MAKEPKGINFO_PKGNAME%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>